{"inkVersion":20,"root":[["^Less than a day after you put him on the case, Kuon has got all the evidence he needs to figure out what Loudon has been up to. Searching the sneak's bunk while he was out, Kuon uncovered written orders for Loudon to spread fear about the Keystone relic. And the cincher is who the orders are from: your business rival, Equinox.","\n","^Even more evidence comes in the form of  footage you've recorded of Loudon sneaking around and putting tiny devices around the ship. A quick analysis of them (after being retrieved by Kuon) shows that they are the source of the strange sounds that have been heard by the crew.","\n","^Before you can decide what to do about Loudon, you receive a message from a nearby ship. It seems Equinox is making their move.","\n","^\"We heard through the grapevine that some of your crew is frightened by 'cursed cargo.' As we only hire the bravest and the best around, we'd be willing to relieve you of this horrible burden. With compensation, of course.\"","\n","^Your rival's offer doesn't even begin to cover the Keystone's value, and it definitely wouldn't soothe your employer's fury if you give it up.  With the damning evidence you have of their little scheme, you could blackmail them and get something useful out of this mess.","\n","^Another option is quietly declining the offer. Blackmailing your rival might just make them want revenge, so maybe using your evidence to get Loudon to behave would settle things down.","\n","^Thinking about it... you could actually accept this offer. The Keystone's container has trackers built into it. If you sold it, you could set the crew's minds at ease. You'd tail Equinox for a while, and once they stopped heading in the same general direction, you'd 'renegotiate' the deal.","\n","ev","str","^Decline Offer, Blackmail Rivals","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Decline Offer, Blackmail Loudon","/str","/ev",{"*":"0.c-1","flg":4},"ev","str","^Accept Offer","/str","/ev",{"*":"0.c-2","flg":4},{"c-0":["^ ",{"->":"Blackmail1"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"->":"Blackmail2"},"\n",{"->":"0.g-0"},{"#f":5}],"c-2":["^ ",{"->":"Accept"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Blackmail1":["^Having Kuon apprehend Loudon, you send Equinox a counter-offer. Either they give you some resources in exchange for Loudon and the evidence you've gathered, or you let the general public know about the dirty, underhanded tactics used by those in the employ of the Equinox conglomerate.","\n","^The response back is rather quick. They accept. Meeting up with them, there is a tense trade-off as Loudon is marched onto the rival ship. On him is a small box, the coffin of this failed stunt to get you to sell the Keystone, filled with all the evidence you had gathered.","\n","^At the same time, several crates are brought onto your ship. Checking them over before Equinox has the chance to scoot off, you confirm they have upheld their end of the deal. There's one crate of fresh rations, one of barely-used, Equinox-produced sidearms, and one with fully-charged energy cells.","\n","^As your disgraced rivals run off, taking their mole with them, your crew has started to feel better about everything.","\n","end",{"#f":1}],"Blackmail2":["^You send a message back, declining their offer. Catching Loudon in a quiet room, you seal the doorways. Telling him you know of his involvement in this whole affair, you offer him a choice. Either he acts as your double agent or you have Kuon escort him to the airlock, where he will start his new career as a piece of space debris.","\n","^He makes the right choice. Any further contact he has with Equinox will be swiftly reported to you, and another part of his penance is debunking the ghost stories he himself had earlier told the crew. He makes fast progress at doing so, setting the crews' minds at ease.","\n","end",{"#f":1}],"Accept":["^You decide to accept their offer. You meet up with the rival ship and give them the 'cursed' Keystone. Although the payment is paltry, the real compensation is the relief most of the crew feels.","\n","^The only objections come from Kuon, his obedience to Kellis clashing with this apparent insubordination. Letting him in on your plans, he seems unhappy with the risk, especially considering the time (however short) he had spent gathering evidence against Loudon and Equinox. That, however, doesn't stop him from volunteering to lead the retrieval team.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}