{"inkVersion":20,"root":[["^As a result of his suspicious behavior, you've been keeping an eye on Loudon. Your focus pays off within a day, as you've got footage of him sneaking around during quiet hours. Especially damning is your video of him hiding miniature speakers around the ship, no doubt the source of the various 'strange noises'. Having Kuon retrieve them, they become the nails in the coffin of Loudon's career.","\n","^The only question remaining, \"why,\" answers itself when a ship belonging to Equinox contacts you. \"We heard through the grapevine that some of your crew is frightened by 'cursed cargo.' As we only hire the bravest and the best around, we'd be willing to relieve you of this horrible burden. With compensation, of course.\"","\n","^Your rival's offer doesn't even begin to cover the Keystone's value, and it definitely wouldn't soothe your employer's fury if you give it up.  The most logical thing to do, declining their offer, would leave you having to deal with their mole, Loudon. Either kick him off at the upcoming pit stop or buy his loyalty out from under Equinox's nose.","\n","^Thinking about it... you could actually accept this offer. The Keystone's container has trackers built into it. If you sold it, you could set the crew's minds at ease. You'd tail Equinox for a while, and once they stopped heading in the same general direction, you'd 'renegotiate' the deal.","\n","ev","str","^Decline Offer, Kick Loudon Off","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Decline Offer, Bribe Loudon","/str","/ev",{"*":"0.c-1","flg":4},"ev","str","^Accept Offer","/str","/ev",{"*":"0.c-2","flg":4},{"c-0":["^ ",{"->":"Decline1"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"->":"Decline2"},"\n",{"->":"0.g-0"},{"#f":5}],"c-2":["^ ",{"->":"Accept"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Decline1":["^You send a message back, declining their offer. You surreptitiously give Kuon orders to escort Loudon off the ship once you dock at the rest point and make sure he doesn't return. You'll have one less crew member but without that weasel around, Equinox won't be able to terrorize your crew anymore. Hopefully they don't try any more underhanded tricks.","\n","^Telling your crew about the whole scheme seems to reassure them. Hopefully the rest of the trip goes smoothly.","\n","end",{"#f":1}],"Decline2":["^You send a message back, declining their offer. You let Loudon know that you're on to him, but that he can stay on if he stops causing trouble. You promising him a pay raise cinches your control of him, as he makes it clear he'll do his best to keep Equinox off your back.","\n","^One of his new duties is disavowing the tales he had been telling about your cargo, which sets your crew's minds at ease.","\n","end",{"#f":1}],"Accept":["^You decide to accept their offer. You meet up with the rival ship and give them the 'cursed' Keystone. Although the payment is paltry, the real compensation is the relief most of the crew feels.","\n","^The only objections come from Kuon, his obedience to Kellis clashing with this apparent insubordination. Letting him in on your plans, he seems unhappy with the risk. That, however, doesn't stop him from volunteering to lead the retrieval team.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}