{"inkVersion":20,"root":[["^Kuon gets your attention. \"I'm sure you've noticed the suspicious goings-on by now. The crew is frightened by the strange noises and a shadowy figure, but I believe there is a mundane explanation. I'm asking permission to investigate. I have an idea of the fool that's behind this.\"","\n","^Asking if it is Loudon that he suspects, he replies in the affirmative, annoyance shaping his brow. \"That rat keeps adding new details to this supposed curse, especially when it comes to this Keystone. I know you can get evidence with some of the ship's surveillance equipment, but I know if given the chance, I'd be able to nail him to the wall with what I'd dig up.","\n","^There are benefits to allowing Kuon to play detective. If Loudon is working for someone some tangible proof would make good blackmail material. However, Kuon is invaluable as the leader of the security team and allowing him the time to investigate would leave the ship less secure overall.","\n","ev","str","^Don't Allow the Investigation","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Allow the Investigation","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["^ ",{"->":"Refuse"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"->":"Allow"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Refuse":["^You reject his request. The ship's automated systems have already caught footage of Loudon acting suspicious, and if you give them a little more focus, you should be able to get enough evidence to justify his expulsion from the crew. It would be nice to be able to prove a motive, but you value having tight security more.","\n","^Kuon seems disappointed for a moment but regains his composure. \"I understand and respect your decision. I shall be getting back to work.\"","\n","end",{"#f":1}],"Allow":["^You allow his request. \"Make sure the security team knows their jobs while you are preoccupied. I'll send you Loudon's schedule so you know when you can search his bunk. I also want you to check out where those noises are coming from.","\n","^\"Let's try to handle this discreetly, as Loudon's already got the crew upset.\" Understanding his orders, Kuon goes off to give the security team instructions. You'll have to be careful while he is busy, otherwise things could go poorly for the whole ship.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}