{"inkVersion":20,"root":[["^Despite the lack of day and night aboard a ship, the human mind is most comfortable when there is such a cycle present. Consequently, right now is a period where almost all of your crew is asleep, and thus none of them would be able to notice what is happening in the cargo hold.","\n","^You, however, aren't human. Sensing movement, your cameras catch two crew members among the various containers. You watch as they attempt to open several of the cargo crates. They are failing to gain entrance to most of them, however, as the remote locks do their work. Eventually they start to use some nearby tools to try to gain access to the contents of the various crates.","\n","^You notice they are unarmed, and seeing that Kuon is still up, ask him to handle the matter quietly. Racing into the cargo hold, he yells at them to stop. However, there is no response. After spending a few moments glancing at them, Kuon speaks to you. \"I think they're in some kind of fugue state. What do you recommend I do?\"","\n","^Seeing that the haphazard way they are beating at the crates with somewhat expensive tools, you should probably have him work quickly, least you have to pay for replacements. With that in mind, the best course of action would be to have Kuon fire on them with his weapons set to stun. However, having your security chief fire on unarmed crew members, even non-lethally, won't help your standing with the crew.","\n","ev","str","^Have Kuon Stun Them","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Have Kuon Subdue Them","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["^ ",{"->":"Stun"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"->":"Subdue"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Stun":["^You decide that whatever standing you may lose with your crew is better than having to replace expensive equipment. You have Kuon set his weapons to their non-lethal setting and fire away. As the crew members fall unconscious, you have Kuon drag them to medbay.","\n","^When they recover, you and Kuon question them. It seems they have no memory at all of what just happened. As their responses come off as genuine, you allow them to return to their bunks. Kuon asks that he be allowed to stand guard in the cargo hold for the rest of the trip. You allow this, as he seems to be much more lucid than the rest of the crew.","\n","^Word does get out about how you allowed Kuon to tranquilize some crew members like they were criminals or animals, and with everything else going on, it just drags morale down even more.","\n","end",{"#f":1}],"Subdue":["^You decide that the tools aren't worth the physical and mental safety of your crew. You have Kuon grapple with the crew members individually. Hogtying them so they can't cause any more damage, he takes them to his cabin.","\n","^After an hour or two in their makeshift holding cell, they seem to snap out of their trance. When you and Kuon question them, it becomes clear they have no memory at all of what just happened. As their responses come off as genuine, you allow them to return to their bunks. Kuon asks that he be allowed to stand guard in the cargo hold for the rest of the trip. You allow this, as he seems to be much more lucid than the rest of the crew.","\n","^The tools, however, are going to need replacing. Parts of them lie scattered on the floor, and many of those pieces are bent and twisted in a way that can't easily be fixed. You're going to have to spare the credits to get new ones.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}