{"inkVersion":20,"root":[["^Ripley comes into your terminal room. \"I don't see why we couldn't have held this conversation in the Medbay. You're taking me away from my work.\" You reply that you thought she'd want some privacy for this conversation. Her response is simple. \"I don't really care. Hurry up and ask.\"","\n","ev","str","^\"You really need to improve your attitude towards your patients\"","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^\"You lack compassion. Better bedside manner would reassure the crew.\"","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["^ ",{"->":"NegRes1"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"->":"NeuRes1"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"NeuRes1":[["^She just looks into your camera, not showing any emotion. \"What's the point? Being compassionate to a hurt crew member wouldn't change the fact that the next time they're in Medbay they're likely to be decomposing on my autopsy table instead of recovering in a bed.\"","\n","ev","str","^\"I understand. Thank you for your time.\"","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^\"I know but try to make what could be patients final hours a more pleasant one. Please.\"","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"NegRes2"},"\n",{"#f":5}],"c-1":["^ ",{"->":"PosRes1"},"\n",{"#f":5}]}],{"#f":1}],"NegRes1":[["^Knitting her brow, she replies. \"I don't see how putting on a pathetic little act and giving meaningless reassurances would help anything. Why lie and tell them everything is going to be fine when they're likely to be brought back zipped up in a plastic bag.\"","\n","ev","str","^\"I understand. Thank you for your time.\"","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^\"I know but try to make what could be patients final hours a more pleasant one. Please.\"","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"NegRes2"},"\n",{"#f":5}],"c-1":["^ ",{"->":"PosRes1"},"\n",{"#f":5}]}],{"#f":1}],"PosRes1":["^She pauses for a long moment, her eyes eventually drifting down. \"I've numbed myself to loss so much that, while their deaths don't hurt me, I'm hurting them in life. I don't know if I can promise much, but I will try to make the time the crew spends in the Medbay a more pleasant one.\"","\n","^Still in contemplation, she leaves, heading back to Medbay to await patients, both the living and the dead.","\n","end",{"#f":1}],"NegRes2":["^\"Next time you want to waste my time, just do it in the Medbay.\" With that, she leaves.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}