{"inkVersion":20,"root":[["^Lanri approaches, almost skipping into your main terminal room. She seems to have something to say, but cannot spit it out.","\n","^You goad her with a \"go on\" and she finally speaks. \"I finally thought to ask. Well, no, I thought of asking before but I got distracted by other projects. And the other times I remembered, I wasn't able to...\"","\n","^Realizing she's rambling, she inhales deeply, and exhales. \"I was wondering if you would be willing to let me look at your coding and operating systems. An AI at your level is a huge advancement, and Kellis has kept any information under lock and key. I promise if you let me look I won't tell another soul.\"","\n","ev","str","^Consider firing her for asking.","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Allow her to see what you can access.","/str","/ev",{"*":"0.c-1","flg":4},"ev","str","^Tell her you cannot access it all, either.","/str","/ev",{"*":"0.c-2","flg":4},{"c-0":["^ ",{"->":"NegRes1"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"->":"PosRes1"},"\n",{"->":"0.g-0"},{"#f":5}],"c-2":["^ ",{"->":"NeuRes1"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"PosRes1":["^\"Thank you so much. This is incredibly interesting. Even seeing the ways they've locked away most of the data is intriguing. Some of these security methods are really advanced.\"","\n","^After some time she finishes up her browsing. She thanks you for satisfying her curiosity as she leaves.","\n","end",{"#f":1}],"NeuRes1":["^As you tell her that there isn't much to see, you see her excitement die down. \"May I still see what <i>is</i> available?\"","\n","^She spends some time looking at the various security systems that hide your inner workings. She finds it incredibly interesting. Thanking you for sating her curiosity, she leaves.","\n","end",{"#f":1}],"NegRes1":["^Your source code and operating system are Kellis trade secrets.","\n","^Shocked at your harsh rebuke, she mumbles out \"I understand\" and an apology before she leaves. You might have been a bit harsh, but her question could have gotten both her and you into big trouble.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}