{"inkVersion":20,"root":[["^Lanri walks into your terminal room unusually calm and controlled. \"You wanted to know why I asked you to keep my various research notes quiet, right?\"","\n","^Confirming her astute guess, you ask her to continue. \"I don't want it being misused. Sharing information is important to scientific progress, but, no offense, I don't trust Kellis to make it easily accessible. I expect them to keep it private and use it...maliciously.\"","\n","ev","str","^Ask if her research has been misused.","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Assure you will respect her privacy.","/str","/ev",{"*":"0.c-1","flg":4},"ev","str","^Say her research belongs to Kellis.","/str","/ev",{"*":"0.c-2","flg":4},{"c-0":["^ ",{"->":"NeuRes1"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"->":"PosRes1"},"\n",{"->":"0.g-0"},{"#f":5}],"c-2":["^ ",{"->":"NegRes1"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"PosRes1":["^Lanri seems suspicious with your answer. After promising your sincerity, she perks up. \"Thank you so much. I love doing research and learning new things. There's just this fear that it will be misused and hidden from others.\"","\n","^She turns to leave, before turning back and adding one more remark. \"And thanks for not asking about the past.\" She leaves.","\n","end",{"#f":1}],"NeuRes1":[["^Her face darkens and she looks away. \"I'm not going into it. Are you okay with me keeping my research private?\"","\n","ev","str","^Assure you will respect her privacy.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Say her research belongs to Kellis.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"PosRes2"},"\n",{"#f":5}],"c-1":["^ ",{"->":"NegRes1"},"\n",{"#f":5}]}],{"#f":1}],"NegRes1":["^\"What's the point of doing research to help people when that research can only be used by those working for a corporation?\" Anticipating a reply, she cuts you off. \"And trust me, they won't be using it for good. They will use it to increase their bottom line, consequences be damned.\"","\n","^She storms out of the room.","\n","end",{"#f":1}],"PosRes2":["^Lanri seems suspicious with your answer. After promising your sincerity, she perks up. \"Thank you so much. I love doing research and learning new things. There's just this fear that it will be misused and hidden from others.\" She leaves.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}