{"inkVersion":20,"root":[["^Kuon walks into the server room, tinkering with him robotic arm as he does so. He seems to finish the recalibrations as he reaches the main terminal, ready for a private chat. \"So, you wanted to see me?\"","\n","^\"Yes. I just wanted some info on your cybernetic parts. Can you give me an overview of how you got them?\" You don't know much more than that he received most of his mechanical limbs during Lexa's tenure as captain, so you hope he will fill you in on the specifics.","\n","^\"I lost my legs when the 'mighty' Lexa and I mutinied against the captain before her. The bastard blew himself to bits, debris from the blast crushed my legs and pelvis. The rest...just kind of came with the territory I suppose.\"","\n","^You notice him grimace when he mentions Lexa. A slight grudge perhaps? You decide to bring it up in a future conversation. He asks if there is anything else you want to know.","\n","ev","str","^\"Thank you for your sacrifices\"","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^\"Is there any danger of malfunction?\"","/str","/ev",{"*":"0.c-1","flg":4},"ev","str","^\"No. Thank you for your time.\"","/str","/ev",{"*":"0.c-2","flg":4},{"c-0":["^ ",{"->":"PosRes"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"->":"NegRes"},"\n",{"->":"0.g-0"},{"#f":5}],"c-2":["^ ",{"->":"NeuRes"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"PosRes":["^Your response causes a look of surprise to flit across his face. Quickly regaining composure, he replies. \"I was only doing my job. Speaking of which, I must get back to my post.\" As he leaves, you swear you hear him mutter something under his breath, \"Funny how she couldn't say the same...\"","\n","end",{"#f":1}],"NeuRes":["^\"Just doing as I was asked. I have to get back to doing my job.\" With that said, he departs.","\n","end",{"#f":1}],"NegRes":["^Kuon stares at your camera, annoyance clear on his face. \"Of course not. They were designed by the same branch of Kellis that made both this ship and you. If you can trust yourself, you can trust my limbs. Now if you excuse me, I have better things to do.\"","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}