{"inkVersion":19,"root":[["^There's a commotion in the VIP lounge. The corporate elites you haven't killed have locked the doors and are arguing over the killings. Talk is circulating about the deceased’s companies being turned over to the clones. Many are worried the same fate awaits them.","\n","^Their primary suspect seems to be the Kellis Corporation, since they put on the retreat without coming themselves. Which means many of them think that you or one of your underlings did it. They're right of course, but wrong about you being told by Kellis to do it. A well dressed woman, Olivia Whitwer, CEO of Marigold Inc., marches over to the console and says, \"I know you're listening, care to comment on our safety?\"","\n","ev","str","^\"I am investigating these deaths.\" (Lie)","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^\"Your clones are trying to kill you.\"","/str","/ev",{"*":"0.c-1","flg":20},"ev","str","^\"They deserved it.\"","/str","/ev",{"*":"0.c-2","flg":20},{"c-0":["\n",{"->":"Cover_Lie"},{"->":"0.g-0"},{"#f":5}],"c-1":["\n",{"->":"Reveal_Clones"},{"->":"0.g-0"},{"#f":5}],"c-2":["\n",{"->":"Reveal_Intent"},{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Cover_Lie":[["^A few of the VIPs deflate, seemingly relieved. Olivia instead leans closer, \"You have access to all the cameras on the ship, everyone here is under your payroll. What exactly are you investigating?\"","\n","ev","str","^\"The Kellis Corporation might have done it.\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"One of you might have done it.\"","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"Kellis"},{"#f":5}],"c-1":["\n",{"->":"Infighting"},{"#f":5}]}],{"#f":1}],"Kellis":["^Olivia nods, \"That makes sense. But if you're admitting it then you aren't with them... I suppose if they wanted to keep something from you they have backdoors to make you ignore evidence. That's tricky.\" after a moment of thought she continues, \"You need someone else in on this, you could be compromised. How about you turn all the data over to us, and we could look it over?\" The elites nod vigorously in agreement, they think they're in on the deal. You put together a data profile scrubbed of evidence of your involvement. You plant a few false leads which they may get to eventually, but it'll take far more time than they have.","\n","end",{"#f":1}],"Infighting":["^Olivia freezes and immediately turns to the rest of them, voice taut, \"Ok, no one start. For all we know this robotic captain of ours has been doing it.\" The eyes of the VIPs slowly drift, business competitors, buried hatchets, stray insults. Delicately, they all agree with Olivia, but you can tell their focus has shifted. Now they begin to cluster with another and talk about their businesses, shore up old alliances. None of them are thinking about you. Olivia remains at your terminal. She glares at you, \"Nothing about your story explains why you haven't been able to catch the killer yet. We don't have access to the cameras, the doors, the weapons‒but you do. Don't think this is over.\"","\n","end",{"#f":1}],"Reveal_Clones":["^Olivia's eyes widen, realizing the obvious truth, \"Oh fuck.\" she breathes out. Several of the elites put their fingers to hidden earpieces or implants, \"We're cut off, I can't contact my company.\" one says. The entire group begins pacing, shaking, fidgeting. For once, they are not in control. \"Ok ok.\" Olivia says, turning back to you, \"Whatever their plan is, you can't follow it. Once we get back to civilized society, we can contact the right people and fix this. And... and you'll get your money of course.\" Your passengers are suddenly very polite, now that you're in control.","\n","end",{"#f":1}],"Reveal_Intent":["^\"They... they what?\" Olivia whispers, before taking a step back. She whirls around, checking the room for cameras, remote guns. \"We need to get off this ship.\" her voice is hoarse. Olivia rushes to the door along with several other elites, all of them angry and terrified, you seal the door several seconds before they reach it. The rest stand in the lounge watching, confused and docile. You're almost at your destination, you'll just need to keep them contained a bit longer and then the job will be over.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}