{"inkVersion":19,"root":[["^Your ship is passing near the site of a very unstable star. The elites have asked you to take them within a safe distance to watch it explode into a supernova . While the supernova is happening, Beckett, drunk, wanders into the airlock. If you're willing to take the clones up on their offer, this could serve as the perfect starting point. Simply open the airlock and that would be Beckett's end. His body would most likely be vaporized once ejected, and considering his unlikable behavior, the other clients will hopefully not take notice of his absence. If you do this, the company (and you) stand to gain a good amount of credits from the clones, but murdering a client may come back to trouble you in the future.","\n","ev","str","^Kill Him","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Let Him Live","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["^ ",{"->":"Death"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"->":"Life"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Death":["^You decide to go through with it. Due to his inebriation, he doesn't have time to react as the doors rush open, sucking him into space. His body gravitates towards the supernova and is annihilated by the heat. While his unappealing behavior has made it unlikely that his absence will be noticed by the other elites and your crew, in the event of inquiry, you are prepared to say that Beckett is feeling under the weather, and that he has decided to stay in his cabin until arrival at the rest point, where he plans to disembark and head home early. When the clones get in contact with you again, you will report to them that the original Miniver Beckett is dead.","\n","end",{"#f":1}],"Life":["^You decide not to start killing the originals. Despite Beckett's bad attitude, a client is a client, and anything \"unfortunate\" happening to him has the possibility of reflecting badly on you and the company. While the additional financial compensation would be nice, it's better not to take any chances. When the clones contact you again, you will let them know that you did not take them up on their offer.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}