{"inkVersion":19,"root":[["^As you approach the resort planet, the VIPs are talking in their lounge. A few are starting to  panic again, figuring  that you are most likely going to deliver them into the jaws of death. One member decries that she will never see her wife or kids again. Another bemoans that he won't be able to see his company flourish.","\n","^Olivia Whitwer calls for everyone's attention, and as the room quiets down and starts to speak: \"Now my faith in the ship's AI or any of its crew is just as lacking as all of yours is, but we need to keep  calm. If the AI tries anything, we can band together. Despite our losses there are still many of us, and relatively few of them. Our main goal is to stay alive, and once we get back to civilization, we can look into what has happened so far and do something about this ship.","\n","^As you receive an alert that you are in close range of the planet, you consider the options you have before you. You could go ahead to the dock where the clones are planning their ambush, although if any of your clients notice you are heading towards the wrong destination they may act against you. You could also go ahead and deliver the elites to the party, although the clones are likely to attempt something.","\n","ev","str","^Approach Party","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Approach Trap","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["^ ",{"->":"Party"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"->":"Trap"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Party":[["^You decide to take the elites to the party. Although at first hesitant to disembark, a few of your clients recognize the location from their previous visits. Encouraged, the VIPs get off your ship quickly, albeit with an air of caution. As they are stepping off you pick up a few snippets of conversation. A few are chatting about your payment, with their opinions differing somewhat. \"No way in hell am I paying,\" is the position of one disgruntled exec, while another states \"Well, they did deliver us to our destination.\"","\n","^From the conversations, it is clear that you will receive some of your payment, although the amount of credits may be somewhat paltry compared to what was promised. That being said, the clones are still on the planet, and may still try to take control. To make sure everything turns out right, you decide to stay near the planet and monitor the situation.","\n","^A few days later, your sensors pick up what appears to be an attack on the resort. The resort's defenses are causing interference with your monitoring equipment, but it is still apparent that this is the work of the clones, as you pick up images of the elite's doppelgangers dressed in combat armor. The resort has various defenses and security personnel, so the clones will likely fail in their attempt. That being said, you could take advantage of the situation.","\n","ev","str","^Stay Out of It","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Enter the Fray","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"Leave"},"\n",{"#f":5}],"c-1":["^ ",{"->":"Battle"},"\n",{"#f":5}]}],{"#f":1}],"Leave":["^You decide that getting involved is a bad idea. The resort's security forces are likely to assume you are trying to help the clones and may turn their weapons on you.  Over the next few days, you get reports that a terrorist group had been decimated after an attempted attack. It seems likely that the clones had failed in their goal, and so you await your payment, as paltry as it might be.","\n","^Some time passes, and no payment is received. When you inquire about this,  you get a response. It states that due to the deaths during the trip and suspicious behavior on the part of you and your crew, you will only receive a piddling amount of credits.","\n","^Soon after, you also receive a transmission. On the video screen is what appears to be Olivia Whitwer. Glaring, she states, \"You think you deserve payment? After the incidents during the voyage, you shouldn't receive a single credit. After all,\" she starts \"why should we pay someone who can't follow through?\" What you now know to be Olivia Two suddenly smirks before continuing, \"While we are giving you only the bare minimum payment, your disloyalty to us might net you a little 'surprise gift' in the future.\" Glaring again, she finishes her threat, \"Those who betray both sides will have no one left to turn to. I hope you and your crew remember that when your time comes.\"","\n","end",{"#f":1}],"Battle":["^You decide it is best to get involved. If you aid the security forces and the elites against the clones, you may earn their trust, as well as a bonus. As you come within range of the resort, your sensors are able to read the situation clearly. Surprisingly, the clones appear to be victorious, as most of the security appears to be dead.","\n","^As you come close to land, you start getting fired on. It appears that not only have they taken out the resort's defenders, but they have also taken control of the resort's anti-spacecraft defenses. Shots start being traded between the two sides. While you have unerring accuracy, scoring a hit with nearly every shot, your attackers also score some hits, the impacts causing your ship to shake and buck.","\n","^You manage to take out the various turrets that are firing on you, killing their controllers. Safe for the moment, you quickly scan the base. Your sensors tell you that of the various people below, it is only the clones that remain alive. The originals, dressed in their expensive clothing, lie dead around the base next to the various staff members of the resort dressed in their various uniforms.","\n","^You also check the conditions of your ship and crew. Reports aren't good. The hull has taken quite a bit of damage. The impacts caused some of the more volatile equipment to partially explode. Many crew members lie injured and dead, either from being tossed about by the ship's or from shrapnel slicing into them.","\n","^You decide to raze what remains of the resort to the ground, killing the remaining clones so they can not seek revenge. As the ship crawls back to the nearest station to get repairs, you send word of what happened to the Kellis Corporation.","\n","^Surprisingly, your parent company is quite pleased. It turns out that many of the companies run by the deceased elites had very few contingency plans, since many of them were counting on the clones taking over in the case of an emergency. The chaos that is unfolding as the various businesses learn of the deaths of both original and replacement is allowing Kellis to assimilate them one after the other.","\n","^Despite your client's deaths and the heavy toll this trip has had on your ship and crew, you are going to receive a humongous amount of credits. In addition, your company is even taking steps to make it appear like you and your crew had nothing to do with what happened to the elites, meaning that, once the ship is repaired and repopulated, more jobs will be waiting for you.","\n","end",{"#f":1}],"Trap":[["^You decide to take the elites to their final destination. As you approach the coordinates given to you by the clones, you have security round up the elites at gunpoint. Although they outnumber your security crew, they hesitate to act considering they are unarmed. They are brought to the loading bay to await touchdown. Having been grouped together by your security, you notice they are starting to whisper among themselves.","\n","^All of a sudden, Whitwer shouts: \"Now!\" Chaos breaks out as the several elites start rushing towards the security team. Weapons start going off, and several of your crew go down under the assault of the VIPs. You have to give orders quickly, before you fully lose control of the situation. You get the sense that the clones wanted to be the ones who took out the originals but taking prisoners in this battle might be costly.","\n","ev","str","^Subdue Them","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Take No Prisoners","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"Stun"},"\n",{"#f":5}],"c-1":["^ ",{"->":"Kill"},"\n",{"#f":5}]}],{"#f":1}],"Stun":["^You send out the order to avoid using lethal force no matter the cost. The element of surprise wearing off, security crew acts swiftly, switching their weapons to stun. Shots start ringing out and bodies start hitting the floor. Once the last of the elites is down for the count, you request status of both parties. While most of the elites lay unconscious, several of them are laying in pools of blood, as some of your security had acted before you gave orders. Also, among the prone figures are several dead crew members, having been beaten and crushed by your frenzied clients. The precious seconds it took to switch from kill to stun turned out to be costly.","\n","^As you land at the dock, you prepare the remaining elites, their hands bound, to be marched out. Those who perished in the preceding events have been unceremoniously stuffed into a spare cargo container, which you will present alongside their breathing brethren.","\n","^The clones are waiting in a group, flanked by metal-clad mercenaries, most pointing weapons towards the bay doors in preparation for the originals. Whitwer and Beckett's clones step forward. Olive Two speaks:  \"Well, we've been expecting you. Are they all in the loading bay?\" You reply in the affirmative but tell them about the trouble you've had. Beckett Two seems annoyed: \"What the fuck does that matter! March them out here so we can have our fun!\"  However, Olivia's clone seems to have other ideas, turning to the other clones, she gets their attention. As a sadistic smirk crosses her face, she speaks, \"We wished to get retribution for the years of servitude and pain our originals put us through, right? What better way to get our revenge than to make them take our place? Let’s see how they like being used as spare parts.\"","\n","^She lays out a plan in which they would take the place of the originals, and their templates would take their place as servants and organ banks. Once more speaking to you, she speaks \"Thank you for all you have done. You will find that your reward will be a king's ransom. All that is left is to release the 'clones' into our custody.\" You open the bay doors and have security lead out the prisoners, as well as the container holding the slaughtered members. The clones take over command of them, and you have security withdraw. As you get ready to leave, your sensors pick up Whitwer's clone standing above her now-kneeling original. Right before liftoff, you hear her gloat, \"I'm in charge now. Isn't that right, Oliva Two?\"","\n","end",{"#f":1}],"Kill":["^Not wanting to risk the lives of your security team, you order them to open fire. The elites are quickly cut down. Energy weapons melt through tissue, fusing clothing to flesh and leaving vital organs charred to a crisp. Once the last elite meets their grisly demise, you take stock of the situation. While a few of the crew members are heavily injured, they will survive. You have the bodies gathered and thrown into a spare cargo container.","\n","^You touch down at the coordinates given to you. The clones are waiting in a group, most pointing weapons towards the bay doors in preparation for the originals. Whitwer and Beckett's clones step forward. Olivia Two speaks:  \"Well, we've been expecting you. Are they all in the loading bay?\" You reply in the affirmative but tell them about the trouble you've had. Most of the group seems displeased at the news. Beckett Two screams: \"You fucker! How dare you take away our chance to extract our pound of flesh from them!\" While also unhappy at the news, Whitwer's clone, more level-headed than her screaming partner, speaks to the group, \"I know we wished to be the ones to exact vengeance, but this doesn't change the fact that they are dead, leaving us in charge.\" Speaking to you again, she continues, \"Although you ignored the fact that we wanted this last group delivered alive, you still helped to secure our freedom. While I can't promise that the others will pay you generously for your help, I can assure you I will.\"","\n","^Leaving the bodies in their custody, you depart. A few days later a good amount of credits are deposited in your account. The sum is slightly larger than what the originals had promised you for doing your job, although the costs from complying with the clones' demands might not have been worth the extra revenue.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}