{"inkVersion":19,"root":[["^The clients are having your crew throw them a dinner party. Setting up the lounge for the party, your crew are serving as wait staff for the elites. Unfortunately, an hour into this meal, Miniver Beckett, who has become inebriated, becomes quite irate. Although the other elites he is sitting with make half-hearted attempts to settle him down, he gets up and stumbles over to (Scientist), who is bringing in some more food, having cooked a good portion of the various dishes herself. Being polite, she asks him if he has a problem. \"What is this shit! Are you trying to poison me with this slop?\" is his response, which he follows by knocking the tray out of her hand.","\n","^Indigent, she calls out for you to do something about him. Although Beckett is making an ass of himself and treating (Scientist) and the rest of the crew unfairly, he is still a client. You could side with her and have security do something about Beckett, or you could stay out of it. You could even side with Beckett, as getting in his good graces might be a good idea.","\n","ev","str","^Have Beckett Returned to His Cabin ","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Stay Out of It","/str","/ev",{"*":"0.c-1","flg":4},"ev","str","^Side with Beckett","/str","/ev",{"*":"0.c-2","flg":4},{"c-0":["^ ",{"->":"Scientist"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"->":"Neutral"},"\n",{"->":"0.g-0"},{"#f":5}],"c-2":["^ ",{"->":"Beckett"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Scientist":["^Telling Beckett that his behavior is unacceptable, you order security to take Beckett back to his cabin. When they attempt to escort him back, he starts resisting. Cursing and thrashing at them, his struggles damage some of their equipment. While both the crew and the other elites are glad that he has been removed, the broken equipment will eventually need to be replaced. (Scientist) thanks you for taking your side.","\n","^A few hours later, Beckett calls for your attention. Although sobered, he is still quite irate. \"How dare you have those thugs manhandle me! I deserve respect, and I will not tolerate this shit!\" He goes on to tell you in an obscenity ridden rant that the only thing you will get from him at the end of this trip will be \"jack shit.\"","\n","end",{"#f":1}],"Neutral":["^You choose not to respond. Beckett is already acting belligerent, and getting security involved is unlikely to help the situation. Your silence, even when asked to intervene, will hurt crew morale, as they have had to put up with more verbal abuse and threats of violence. Being called \"dirty paupers\" and having Beckett threaten them with all his financial might do not create a good environment.","\n","end",{"#f":1}],"Beckett":["^You tell (Scientist) that Beckett is a client, and we have to respect him. You ask her to make him up something else is met with her storming off in a huff. Luckily, siding with Beckett seems to appease him. Stumbling back to his seat, he spends the rest of the dinner chatting with the other elites. The next morning you receive a message from him, thanking you for putting that \"peasant in her place.\" You notice that several credits have been added to your account.","\n","^Unfortunately, when it comes time for (Scientist) to oversee the food preparation, she refuses, saying she doesn't want to be \"poison\" anyone. Hopefully she will get over the fact that you chose Beckett over helping her, but in the meantime production of food will be slowed without her oversight.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}