{"inkVersion":19,"root":[["^You manage your trajectory into your assigned landing dock. A crew of engineers swarm the ship seconds after you touch down, each wearing the swan insignia of the Iko Corp. You page security to let them past as they rush to survey their experimental engine. As the Iko team runs diagnostics your contractor steps aboard.","\n","^The man approaches a terminal to speak with you, \"The test went well I trust?\" he seems like he isn't used to his height or his suit, and his gait betrays great stress.","\n","^Protocol demands more information before you answer. \"You are anxious, why?\" you say.","\n","^The man sighs gratefully as you ask, taking the opportunity to air grievances, \"The boss went ahead and made some deals to get us out of the red--so this engine is already slated for mass production. Really we're just here to confirm that it's safe enough for use.\" he adjusts his cufflinks, \"So, is it safe?\"","\n","^The Iko contract states that you would report all findings upon reaching port, but you also understand that a nearly bankrupt research firm being forced out of a major trade deal would have little money left for the bearer of bad news. To insulate your cash flow, you know you should lie.","\n","ev","str","^\"The engine is unsafe.\"(Truth)","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^\"The engine is safe.\"(Lie)","/str","/ev",{"*":"0.c-1","flg":20},{"c-0":["^ The man forces a laugh, obviously not prepared for the possibility of failure. After several seconds of silence you continue, \"The engine has been tested and the diagnostics run. Once you recover your product and pay us for our services, the transaction will be complete.\"","\n","^The man again chuckles out of habit, \"We can't pay you, this was our last shot. We're going under.\"","\n","^\"The Iko company should still have enough assets to pay seventy-five percent the promised credit value. You still owe us.\"","\n","^The man makes a shooing motion with his hand as he wanders away. After an hour, only half the promised credits are wired to your account.","\n",{"->":"0.g-0"},{"#f":5}],"c-1":["^ The man claps his hands together in glee, as you scrub the engine diagnostics of any hint of malfunction. \"Fantastic! I'll let the boss know we have the go-ahead as soon as possible.\" he produces a data pad, looks over the diagnostics, and you detect a large sum of credits added to your account, \"Well, everything should be in order. I look forward to working with you in the future.\" ","\n","^The practiced farewell must usually come with a handshake, as you see the Iko rep stand there awkwardly for three seconds before leaving. They may realize your deception eventually. But at that point production will be well underway, which means their company will have too many lawsuits to bother tracking you down.","\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"#f":1}],"listDefs":{}}