{"inkVersion":20,"root":[["^As you progress ever closer to your destination, Lanri contacts you. \"I'm sorry. I was getting a meal for the crew ready. I had started to prepare it last night. I really messed up. This morning I looked and there's this black mold all over it. I must have stored it wrong. It's all ruined. I've been really stressed. I keep waking up in the night. I'm not getting the sleep I need. I could have made someone really sick...I promise it won't happen again.\"","\n","^Despite what it will cost to replace the food, you let her know that she won't suffer any disciplinary action, just to make sure that she gets the sleep she needs, even if she has to ask Ripley for some sleeping pills.","\n","^Soon after, Ripley also speaks with you. \"I just got done talking with Lanri. I gave her some sleep aides as you suggested. However, she's not the only one who has come to me with these symptoms. Trouble sleeping, bad dreams, and general fatigue. I myself have been struggling getting enough rest. The images of those who I failed to--","\n","^\"Never mind. What I'm getting at is that the crew is stressed. This curse business combined with the usual dangers is causing a lot of anxiety and tension.  They need shorter shifts and lighter loads. I know it will negatively affect our resources, but you will only hurt their morale and cause more mistakes if you refuse.\"","\n","ev","str","^Allow Shortened Work Shifts","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Don't Allow the Shorter Shifts","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["^ ",{"->":"Allow"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"->":"Reject"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Allow":["^Despite the impact of having less work get done, you need your crew to be reliable and less prone to mistakes. You allow any crew members who ask to have lighter shifts for several days.","\n","^While this brightens the spirits of your crew members and will help improve their performance in the long run, you will have to be vigilant for the time being. Less food is being produced, energy output will be down, and there will be holes in your security, so you will have to tread carefully.","\n","end",{"#f":1}],"Reject":["^You veto the shorter shifts. While the crew may be stressed and may make a mistake or two, you still need them working the whole time. Food needs to be grown. Energy needs to be produced. The ship needs to be secured.","\n","^Your job isn't to make the crew like you, and it isn't to keep them happy. Your job is to do what Kellis tells you, and to do that, your crew needs to do their jobs.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}