{"inkVersion":19,"root":[["^The mechanic, Mateo, contacts you, \"Now I swear this may sound like the start of one of my jokes, but the waste disposal systems aren't working correctly. The tanks aren't emptying properly, and they're filling up too quick. If we don't fix it and soon, all that... stuff may damage the ship.","\n","^\"We could have some crew members fix it, but that may not be safe or pleasant for them, y'know. You could also fix it remotely, but that may allow some pressure to build up, and we don't want that.\"","\n","ev","str","^Fix with Crew ","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^Fix Remotely ","/str","/ev",{"*":"0.c-1","flg":20},{"c-0":["^ ",{"#":"50% Chance - 1 Crew"},"\n",{"->":"randomEnd","var":true},{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"#":"(50% Chance - Hull Integrity)"},"\n",{"->":"randomEnd2","var":true},{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Fix1":["^You send a couple crew members to fix the waste disposal systems. Their suits help to protect them from the disgusting muck inside the tanks, and they fix the problem quickly before any damage occurs.","\n","end",{"#f":3}],"Drown":["^You send a couple crew members to fix the waste disposal systems. They manage to fix the problem before any damage is done to the ship. Unfortunately, one of crew member's suits malfunctions, causing it to rapidly fill with sewage, leading to one of the most disgusting deaths possible.","\n","end",{"#f":3}],"Fix2":["^You decide to fix the problem remotely. Using various on-board systems, you manage to repair the disposal systems. While the process was relatively slow, you managed to luck out, as no damage was done to the ship in the meantime.","\n","end",{"#f":3}],"Damage":["^You decide to fix the problem remotely. Using various on-board systems, you manage to repair the disposal systems. Unfortunately, due to the slow speed of this method, the pressure build-up have caused the tanks to put some strain on the hull, leaving them weakened.","\n","end",{"#f":3}],"RandomizeEnding":[{"temp=":"rng"},["ev",{"VAR?":"rng"},0,"==","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"^->":"Fix1"},"/ev",{"VAR=":"randomEnd","re":true},"ev",{"^->":"Fix2"},"/ev",{"VAR=":"randomEnd2","re":true},{"->":".^.^.^.4"},null]}],["ev",{"VAR?":"rng"},1,"==","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"^->":"Drown"},"/ev",{"VAR=":"randomEnd","re":true},"ev",{"^->":"Damage"},"/ev",{"VAR=":"randomEnd2","re":true},{"->":".^.^.^.4"},null]}],[{"->":".^.b"},{"b":["\n","ev",{"^->":"Drown"},"/ev",{"VAR=":"randomEnd","re":true},"ev",{"^->":"Damage"},"/ev",{"VAR=":"randomEnd2","re":true},{"->":".^.^.^.4"},null]}],"nop","\n",{"#f":1}],"global decl":["ev",{"^->":"Fix1"},{"VAR=":"randomEnd"},{"^->":"Fix2"},{"VAR=":"randomEnd2"},"/ev","end",null],"#f":1}],"listDefs":{}}