{"inkVersion":19,"root":[["^The hinges of the door to your office crack in many different places as Lexa throws it open to enter the room. “Game time baby” she roars over and over with unwavering intensity. “There’s a blockade beginning to surround the ship. They won’t let us pass unless we bribe them. You could do that. Or, you let me have em. Which one?”","\n","ev","str","^Bribe (-100 Credits)","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Fight (???)","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["\n",{"->":"Bribe"},{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"#":"(50% FightWin (+100 credits) 50% FightLose (--hull --weapons))"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":[{"->":"randomEnd","var":true},["done",{"#f":5,"#n":"g-1"}],{"#f":5}]}],"done",{"Bribe":["^You decide the trouble of fighting an entire blockade at once isn’t worth it. You give them their credits, pass through the blockade, and continue on your job.","\n","end",{"#f":1}],"FightWin":["^Lexa gives you a devious smirk and an appreciative nod before slamming her fist into her other hand and walking out. She readies the weapons, and starts blasting away. One by one, she obliterates them all. Ripping through each one like wet space paper. You send crew to the destroyed ships to see if anything can be salvaged. They find a nice chunk of Credits intact on one of them.","\n","end",{"#f":3}],"FightLose":["^Lexa gives you a devious smirk and an appreciative nod before slamming her fist into her other hand and walking out. She readies the weapons, and starts blasting away. Many of the opposing ships are destroyed, but the defense team can’t hold them all off. The blockade starts to move in and deal significant damage to your ship. Luckily, you are able to hold on long enough to charge light speed and get away before it’s too late.","\n","end",{"#f":1}],"RandomizeEnding":[{"temp=":"rng"},["ev",{"VAR?":"rng"},0,"==","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"CNT?":"FightWin"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.4"},null]}],["ev",{"VAR?":"rng"},1,"==","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"CNT?":"FightLose"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.4"},null]}],[{"->":".^.b"},{"b":["\n","ev",{"CNT?":"FightWin"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.4"},null]}],"nop","\n",{"#f":1}],"global decl":["ev",{"^->":"FightWin"},{"VAR=":"randomEnd"},"/ev","end",null],"#f":1}],"listDefs":{}}