{"inkVersion":19,"root":[["^Kuon reaches you on an emergency signal, \"Game time,\" he says, \"There’s a military blockade ahead. Three ships. Galactic government. Say they're keeping everyone off this route in case of 'spies' or 'pirates.' I'm sure the former captain would try to smooth this over with coin, but their weapons look outdated. Let me handle this.\"","\n","ev","str","^Bribe","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^Fight","/str","/ev",{"*":"0.c-1","flg":20},{"c-0":["\n",{"->":"Bribe"},{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"#":"(50% FightWin (+100 credits) 50% FightLose (--hull --weapons))"},"\n",{"->":"randomEnd","var":true},{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Bribe":["^You decide the trouble of fighting even a small, understaffed fleet isn't worth it. You follow the lead of the former captain and give them their credits. Their price is highway robbery. You pass through the resctricted zone, and continue on your job. Kuon cuts the call without another word.","\n","end",{"#f":1}],"FightWin":["^Kuon gives you a solemn nod. Soon, the weapons are readied and Kuon is in control. The ship lurches down and blasts the underside of the military ships. They have difficulty maneuvering to hit you, their tech severely outdated.","\n","^Over the course of the next minute, Kuon obliterates them all. You send crew to the destroyed ships and salvage anything worth anything, finding some of their shakedown money intact.","\n","end",{"#f":3}],"FightLose":["^Kuon gives you a solemn nod. Soon, the weapons are readied and Kuon is in control. The ship lurches down and blasts the underside of the military ships. Even with outdated tech though, the military ships are covering all avenues of attack, and are getting hits in.","\n","^Over the course of the next minute, you're peppered with holes. Kuon finds an opening in their formation and you accelerate past, ramping up to light speed as fast as you're able.","\n","end",{"#f":3}],"RandomizeEnding":[{"temp=":"rng"},["ev",{"VAR?":"rng"},0,"==","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"^->":"FightWin"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.4"},null]}],["ev",{"VAR?":"rng"},1,"==","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"^->":"FightLose"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.4"},null]}],[{"->":".^.b"},{"b":["\n","ev",{"^->":"FightWin"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.4"},null]}],"nop","\n",{"#f":1}],"global decl":["ev",{"^->":"FightWin"},{"VAR=":"randomEnd"},"/ev","end",null],"#f":1}],"listDefs":{}}