{"inkVersion":19,"root":[["^The metal door to your office flies open and slams the wall with such force the whole ship could hear it echo. Lexa barges in. \"We have a situation. One of the doors in the Power Core malfunctioned and can’t be opened. 4 crewmates are trapped and losing oxygen inside. Let me blast that fucker open, we need those crewmates for this mission. You could let the engineers fix it, but it may be too late for those crewmates by the time they get it open.”","\n","ev","str","^Force the door open (-100 Credits)","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Wait for engineers (???)","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["\n",{"->":"ForceTheDoorOpen"},{"->":"0.g-0"},{"#f":5}],"c-1":["^ ","\n",{"->":"0.g-0"},{"#f":5}],"g-0":[{"->":"randomEnd","var":true},["done",{"#f":5,"#n":"g-1"}],{"#f":5}]}],"done",{"ForceTheDoorOpen":["^Option 1: Force the door open (-100 Credits)","\n","^You give Lexa the go ahead. 20 minutes later the entire ship violently shakes. Dripping gunpowder, Lexa leisurely strolls back into your office. She takes her time cracking her neck before stating through a smirk “Job is done. Doesn’t look too pretty in there though. Might cost ya something decent to get that fixed”","\n","end",{"#f":3}],"CrewLives":["^(Crewmates are saved) After several hours, Lexa jolts back into the room. “They got em. Their all out and safe. We got lucky this time captain. But next time, for the sake of our lives and your success, let me handle the life or death situations on the ship”.","\n","end",{"#f":1}],"CrewDies":["^(2 crewmates die) After several hours, the dense, heavy footsteps of Lexa roam throughout the halls before she stops in the middle of your office with pure fire in her eyes. “2 lived, 2 suffocated to death. Next time your algorithms should realize you listen to me in these situations if you want to succeed”.","\n","end",{"#f":1}],"RandomizeEnding":[{"temp=":"rng"},["ev",{"VAR?":"rng"},0,"==","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"CNT?":"ForceTheDoorOpen"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.4"},null]}],["ev",{"VAR?":"rng"},1,"==","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"CNT?":"CrewLives"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.4"},null]}],[{"->":".^.b"},{"b":["\n","ev",{"CNT?":"CrewDies"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.4"},null]}],"nop","\n",{"#f":1}],"global decl":["ev",{"^->":"ForceTheDoorOpen"},{"VAR=":"randomEnd"},"/ev","end",null],"#f":1}],"listDefs":{}}