{"inkVersion":20,"root":[["^Kuon slams the wall with such force the whole ship could hear it echo. \"I know you could hear that, AI. We have a situation. One of the doors in the Power Core has malfunctioned and can’t be opened. Four crewmates are trapped and losing oxygen inside. Let me blast that fucker open, we need those crewmates for this mission. You could let the engineers fix it, but it may be too late for those crewmates by the time they get it open.\"","\n","ev","str","^Force the door open","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Wait for engineers","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["\n",{"->":"ForceTheDoorOpen"},{"->":"0.g-0"},{"#f":5}],"c-1":["^ ","\n",{"->":"randomEnd","var":true},{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"ForceTheDoorOpen":["^You give Kuon the go ahead. 20 minutes later the entire ship violently shakes. Dripping gunpowder, he appears on your display. Kuon takes his time cracking his neck before stating through a smirk \"Job is done. Doesn't look too pretty in there though. Might cost you something decent to get that fixed.\"","\n","end",{"#f":3}],"CrewLives":["^After several hours, Kuon jolts back into frame of your cameras. \"They got em. They're all out and safe. We got lucky this time captain. But next time, for the sake of our lives and your success, let me handle life or death situations on this ship.\"","\n","end",{"#f":3}],"CrewDies":["^After several hours, the dense, heavy footsteps of Kuon roam throughout the halls before he perches in front of another camera with pure fire in his eyes. \"Two lived, two suffocated to death. Next time your algorithms should realize you listen to me in these situations.\"","\n","end",{"#f":3}],"RandomizeEnding":[{"temp=":"rng"},["ev",{"VAR?":"rng"},0,"==","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"^->":"ForceTheDoorOpen"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.4"},null]}],["ev",{"VAR?":"rng"},1,"==","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"^->":"CrewLives"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.4"},null]}],[{"->":".^.b"},{"b":["\n","ev",{"^->":"CrewDies"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.4"},null]}],"nop","\n",{"#f":1}],"global decl":["ev",{"^->":"ForceTheDoorOpen"},{"VAR=":"randomEnd"},"/ev","end",null],"#f":1}],"listDefs":{}}