{"inkVersion":20,"root":[["^You receive an alert from the scanners. It appears that a small patch of asteroids lies ahead. You dismiss it, the ship can easily maneuver around these few space rocks. However, you notice that the scanners seem to be picking up some form of energy signature from these asteroids, and it seems to be growing. You take a peek using the ship's external cameras and find great blue crystals embedded within the asteroids ahead of you. You watch as the crystals begin to glow, energy crackling and arcing in various directions before a jagged streak of azure darts across the sky towards another asteroid. The energy looks to be passed back and forth from crystal to crystal, only it seems to be...getting closer? Before you have a chance to react, a monstrous bolt of energy strikes the ship and knocks out the propulsion system. The glow fades from the crystals as you contemplate your next course of action.","\n","ev","str","^Jumpstart the Ship","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Wait for Response","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":[{"->":"Jumpstart"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":[{"->":"Wait"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Jumpstart":["^It takes some metaphorical elbow grease, but you manage to reroute enough power from other systems to start the propulsion drive. The crew is excited to get moving again after having been stuck twiddling their thumbs for a few hours. As you depart you hop on the cameras to see the crystals begin to glow once again. You increase the ship's speed and direct your attention to what may lie ahead.","\n","done",{"#f":1}],"Wait":["^You attempt to communicate with the propulsion drive through the ship's systems, but no matter what you try it refuses to respond. The situation is enough to make your head spin if you had one. You inform the crew that you're all going to be there for an indeterminate amount of time. As expected, no one is too pleased to hear the news. It takes approximately 58 hours before you're able to connect to the propulsion system and get it back online. As the engines roar to life once more the crew begins to cheer. You leave the region before anything else has a chance to happen.","\n","done",{"#f":1}],"#f":1}],"listDefs":{}}