{"inkVersion":20,"root":[["^During your journey, you happen upon a suspicious asteroid carrying some form of organic growth. The crew gather at the observation window to gawk at such an oddity. Suddenly, without warning, the growth ruptures. An orange cloud of spores spews forth in all directions, catching the ship in the blast. You frantically leave the cloud, but not before some of the crew were exposed to the spores. They are taken to the Medbay, where you watch their condition worsen from the camera system. Over a ten-minute period their flesh falls apart, collecting in a squelching pile. How are you going to deal with this unsightly mess?","\n","ev","str","^Recycle the Meat","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Dispose of the Meat","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["^ ",{"->":"randomEnd","var":true},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":[{"->":"Dispose"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Goodmeat":["^The crew sent to clean the Medbay are sworn to secrecy, and they stay true to their word. The rest of the crew are pleased to actually have “some proper meat”, none the wiser as to where it came from.","\n","done",{"#f":3}],"Badmeat":["^The crew sent to clean the Medbay are sworn to secrecy, but they are unable to keep quiet about this subject. Although you manage to dispel their words as nothing more than a rumor, the damage has already been done.","\n","done",{"#f":3}],"Dispose":["^They didn’t deserve such a gruesome fate. You have some crew gather what’s left of their comrades in a small storage container, and prepare to eject it from the airlock. You observe as other members say tearful goodbyes. After the last one is finished speaking you close the exterior hatch and eject the contents of the airlock. The crew thank you for giving them a chance to say goodbye. They seem to be in decent spirits considering the events that have unfolded.","\n","done",{"#f":1}],"RandomizeEnding":[{"temp=":"rng"},["ev",{"VAR?":"rng"},0,"==","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"^->":"Goodmeat"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.3"},null]}],["ev",{"VAR?":"rng"},1,"==","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"^->":"Badmeat"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.3"},null]}],"nop","\n",{"#f":1}],"global decl":["ev",{"^->":"Goodmeat"},{"VAR=":"randomEnd"},"/ev","end",null],"#f":1}],"listDefs":{}}