{"inkVersion":20,"root":[["^As you continue on your journey you pick up a curious signal. You eventually draw closer to the source of the beacon: a wreck floating aimlessly amidst the stars. In the time it takes for your crew to wonder if there are any survivors aboard, the radar cries out.","\n","^You appear to be surrounded by a number of unknown vessels. Soon, a communications request comes in and you tentatively answer. They inform you that you are currently flying through a sector which requires a toll for safe passage. The ships waiting ominously around you want to know: your money or your lives?","\n","ev","str","^Face Them","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Retreat","/str","/ev",{"*":"0.c-1","flg":4},"ev","str","^Pay the Toll","/str","/ev",{"*":"0.c-2","flg":4},{"c-0":[{"->":"Face"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":[{"->":"Retreat"},"\n",{"->":"0.g-0"},{"#f":5}],"c-2":[{"->":"Pay"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Face":["^The bandits wait patiently for your response, which you deliver swiftly and decisively. Your ship's weapons obliterate one of the bandits upon the horizon. A firefight breaks out as a result, but in the end, yours is the only ship left. The hull has sustained some damage, but you manage to salvage some of the loot from the bandit ships before you depart.","\n","done",{"#f":1}],"Retreat":["^You configure the engines to make a hasty retreat, certain that these cowardly bandits won't pursue. In a flash, the engines roar to life and you begin a speedy escape. The ships bombard you, but thankfully none of the shots damage the propulsion system. You've escaped the bandit’s trap worse for wear, but still alive nonetheless.","\n","done",{"#f":1}],"Pay":["^You reluctantly agree to pay the toll for safe passage. The worry that these bandits will simply pocket the credits and kill you anyway snakes its way through the crew as you transfer the funds. Upon the completion, the ships ahead of you part. “Thanks for doin' business with us. We look forward to your next visit.” The bandits cackle to themselves as you quickly depart.","\n","done",{"#f":1}],"#f":1}],"listDefs":{}}