{"inkVersion":19,"root":[["^The ship mechanic, Mateo, contacts you, \"There seems to be a major problem with the engine. It's starting to overheat, and if something isn't done soon, the surrounding hull is going to start melting like wax in the desert. A few parts are malfunctioning, and they need to be fixed, pronto.\"","\n","^\"We could have some crew members suit up and do the work, but I don't trust the protection suits the company issued us. They're about a century outdated. We could make it safer if we use parts from around the ship, but replacing those would be costly.\"","\n","ev","str","^Risk Crew Members","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^Salvage Parts","/str","/ev",{"*":"0.c-1","flg":4},"ev","str","^Leave It Be","/str","/ev",{"*":"0.c-2","flg":4},{"c-0":["\n",{"->":"randomEnd","var":true},{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"->":"Repair"},"\n",{"->":"0.g-0"},{"#f":5}],"c-2":["^ ",{"->":"Leave"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Survive":["^You order the crew members to fix the engine. Luckily their quick and efficient methods mean the engine is stabilized without much incident. Despite Mateo's warning, the safety gear holds up just fine.","\n","end",{"#f":3}],"Sacrifice":["^You order the crew members to fix the engine. While the engine is stabilized, Mateo's fears were well rounded, as two crew members suits tear wide open. They are burned to cinders by the heat still emanating off the engine.","\n","end",{"#f":3}],"Repair":["^Not wanting to risk the lives of your crew members, you have the engine repaired with parts of the ship. While the ship is now safe, the parts used in the process are need to be replaced, and doing so isn't going to be cheap.","\n","end",{"#f":1}],"Leave":["^You leave the engine be and hope for the best. Luckily, the engine eventually stablizes on its own, but the intense heat has melted much of its surroundings, leaving the hull in a poor state.","\n","end",{"#f":1}],"RandomizeEnding":[{"temp=":"rng"},["ev",{"VAR?":"rng"},0,"==","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"^->":"Survive"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.4"},null]}],["ev",{"VAR?":"rng"},1,"==","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"^->":"Sacrifice"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.4"},null]}],[{"->":".^.b"},{"b":["\n","ev",{"^->":"Sacrifice"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.4"},null]}],"nop","\n",{"#f":1}],"global decl":["ev",{"^->":"Survive"},{"VAR=":"randomEnd"},"/ev","end",null],"#f":1}],"listDefs":{}}