{"inkVersion":20,"root":[["^The ship mechanic, Mateo, contacts you. \"There seems to be a major problem with the engine. It's starting to overheat, and if something isn't done soon, the surrounding hull is going to start melting like wax in the desert. A few parts are malfunctioning, and they need to be fixed, pronto.\"","\n","^\"We could have some crew members suit up and do the work, but I don't trust the protection suits the company issued us. They're about a century outdated. We could make it safer if we use parts from around the ship, but replacing those would be costly.\" It's clear from how he speaks that he wants to avoid sending the crew out, but the choice is yours to make.","\n","ev","str","^Risk Crew Members","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^Salvage Parts","/str","/ev",{"*":"0.c-1","flg":4},"ev","str","^Leave It Be","/str","/ev",{"*":"0.c-2","flg":4},{"c-0":["\n",{"->":"randomEnd","var":true},{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"->":"Repair"},"\n",{"->":"0.g-0"},{"#f":5}],"c-2":["^ ",{"->":"Leave"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Survive":["^You order the crew members to fix the engine. Luckily, their quick and efficient methods mean stabilizing the engine occurs without much incident. Despite Mateo's warning, their safety gear holds up just fine.","\n","^\"Well I'll be damned. I've never been so glad to be wrong before.\" The tension leaves his face as he chuckles softly, \"Let's get a move on before something else goes wrong.\"","\n","end",{"#f":3}],"Sacrifice":["^You order the crew members to fix the engine. While the engine is stabilized, Mateo's fears were well founded. Two crew members suits tear wide open. They are burned to cinders by the heat still emanating off the engine.","\n","^Mateo lets out a heavy sigh, \"Never thought I'd hate being right so much. Let's get the hell out of here before anything else can go wrong.\"","\n","end",{"#f":3}],"Repair":["^Not wanting to risk the lives of your crew members, you have the engine repaired with materials from the ship. While the engines are fuctional once again, the parts used in the process will need to be replaced. Doing so isn't going to be cheap.","\n","end",{"#f":1}],"Leave":["^You leave the engine be and hope for the best. Luckily, the engine eventually stablizes on its own, but the blistering heat has melted much of its surroundings, leaving the hull in a poor state.","\n","end",{"#f":1}],"RandomizeEnding":[{"temp=":"rng"},["ev",{"VAR?":"rng"},0,"==","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"^->":"Survive"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.4"},null]}],["ev",{"VAR?":"rng"},1,"==","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"^->":"Sacrifice"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.4"},null]}],[{"->":".^.b"},{"b":["\n","ev",{"^->":"Sacrifice"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.4"},null]}],"nop","\n",{"#f":1}],"global decl":["ev",{"^->":"Survive"},{"VAR=":"randomEnd"},"/ev","end",null],"#f":1}],"listDefs":{}}