{"inkVersion":19,"root":[["^A ship pulls up alongside your own and wastes no time hijacking your communications channel. A man with questionable fashion appears, “Hey there ya space slugs! How fast does that hunk o' junk fly? I bet ya' that ya' can’t beat my beautiful Maxine!” It seems you’ve been challenged to a race, will you take the man up on his offer?","\n","ev","str","^Accept the Challenge","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Chicken Out","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["\n",["ev","visit",5,"seq","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"ev","du",2,"==","/ev",{"->":".^.s2","c":true},"ev","du",3,"==","/ev",{"->":".^.s3","c":true},"ev","du",4,"==","/ev",{"->":".^.s4","c":true},"nop",{"s0":["pop","\n",{"->":"Win"},{"->":".^.^.35"},null],"s1":["pop","\n",{"->":"Lose"},{"->":".^.^.35"},null],"s2":["pop","\n",{"->":"Win"},{"->":".^.^.35"},null],"s3":["pop","\n",{"->":"Lose"},{"->":".^.^.35"},null],"s4":["pop","\n",{"->":"Pull"},{"->":".^.^.35"},null],"#f":5}],"\n",{"->":"0.g-0"},{"#f":5}],"c-1":[{"->":"Leave"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Win":["^Both ships rocket forward, neck and neck. You swiftly approach the moon and at the last second reroute more power to the engines. Your ship manages to pull ahead, and you win the race. The man says nothing as your crew cheer, and departs.","\n","done",{"#f":1}],"Lose":["^Both ships rocket forward, neck and neck. As you approach the moon the man can be heard once more, “You didn't think I was givin' it all she's got did you?”. Your crew can only watch as the opposing ship blasts ahead to claim victory. The crew, disheartened, listens to the man laugh as you depart.","\n","done",{"#f":1}],"Pull":["^Both ships rocket forward, neck and neck. It's anyone's guess as to who will win, but your race is cut short. An enforcement ship appears upon the horizon and demands you come to a halt. You comply, the other racer doesn't. For breaching the speed limit without authorization your ship is fined a sum of credits, but is otherwise free to go.","\n","done",{"#f":1}],"Leave":["^The man cackles, “I knew you lot were slugs, but it turns out you're chickens too! Bawk! Bawk! Bawk!” The man's mocking squawks can be heard until your ship leaves communication range.","\n","done",{"#f":1}],"#f":1}],"listDefs":{}}