{"inkVersion":19,"root":[["^After some rummaging through the cargo hold a few crew members manage to find a few strange boxes. You recognize them as a discontinued Kellis product: “The Surprise Box”. All one needs to do is deposit the appropriate amount of credits for the box to open, revealing the surprise. The contents could range from worthless garbage to valuables, shall you test your luck?","\n","ev","str","^Pay to Play","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Jettison the Boxes","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":["\n",["ev","visit",6,"seq","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"ev","du",2,"==","/ev",{"->":".^.s2","c":true},"ev","du",3,"==","/ev",{"->":".^.s3","c":true},"ev","du",4,"==","/ev",{"->":".^.s4","c":true},"ev","du",5,"==","/ev",{"->":".^.s5","c":true},"nop",{"s0":["pop","\n",{"->":"Garbo"},{"->":".^.^.41"},null],"s1":["pop","\n",{"->":"Garbo"},{"->":".^.^.41"},null],"s2":["pop","\n",{"->":"Garbo"},{"->":".^.^.41"},null],"s3":["pop","\n",{"->":"Food"},{"->":".^.^.41"},null],"s4":["pop","\n",{"->":"Munitions"},{"->":".^.^.41"},null],"s5":["pop","\n",{"->":"Power"},{"->":".^.^.41"},null],"#f":5}],"\n",{"->":"0.g-0"},{"#f":5}],"c-1":[{"->":"Jett"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Garbo":["^After the box has registered the transfer of credits it's sides fall away to reveal the surprise within. The contents of this box are little more than garbage, various toys and trinkets that you have no use for.","\n","done",{"#f":1}],"Food":["^After the box has registered the transfer of credits it's sides fall away to reveal the surprise within. The contents of this box are military grade rations. While they hold little flavor the extra food is welcome.","\n","done",{"#f":1}],"Munitions":["^After the box has registered the transfer of credits it's sides fall away to reveal the surprise within. The contents of this box are a supply of munitions. The security detail will make good use of this windfall.","\n","done",{"#f":1}],"Power":["^After the box has registered the transfer of credits it's sides fall away to reveal the surprise within. The contents of this box are a few spare power cells. While some of the crew seem disappointed, you know the extra power will help more than they realize.","\n","done",{"#f":1}],"Jett":["^You decide to simply rid yourself of the boxes. You'll never know what they held inside, but you figure that you didn't miss much.","\n","done",{"#f":1}],"#f":1}],"listDefs":{}}