{"inkVersion":20,"root":[["^The ship finds itself in the midst of an asteroid field. However, the journey is interrupted by a blinding flash followed by the sudden emergence of lights of all colors dancing across the sky. A massive aurora stretches into the horizon, and it seems to be having adverse effects on any crew member that looks at it. How shall you proceed?","\n","ev","str","^Fly Blind","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Continue as Normal","/str","/ev",{"*":"0.c-1","flg":4},{"c-0":[{"->":"Blind"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["\n",["ev","visit",4,"seq","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"ev","du",2,"==","/ev",{"->":".^.s2","c":true},"ev","du",3,"==","/ev",{"->":".^.s3","c":true},"nop",{"s0":["pop","\n",{"->":"Gluttony"},{"->":".^.^.29"},null],"s1":["pop","\n",{"->":"Greed"},{"->":".^.^.29"},null],"s2":["pop","\n",{"->":"Wrath"},{"->":".^.^.29"},null],"s3":["pop","\n",{"->":"Lust"},{"->":".^.^.29"},null],"#f":5}],"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Blind":["^The crew all close their eyes and you find that controlling the ship without assistance is more difficult than you had anticipated. After a few collisions with asteroids, you manage to maneuver the ship out of the range of the aurora. The ship has sustained some damage, but the crew are safe.","\n","done",{"#f":1}],"Gluttony":["^You manage to escape the aurora, but it seems to have affected the crew. They all complain of ceaseless hunger, ransacking the stores of food onboard. They eat until they are unable to continue. You've lost food, but that is all.","\n","done",{"#f":1}],"Greed":["^You manage to escape the aurora, but it seems to have affected the crew. The crew begin taking what they feel they “deserve”. Stealing and hoarding credits from any place they can find, including the ship's stockpiled wealth. After they regain their senses they apologize, but it's unclear who took money from the ship.","\n","done",{"#f":1}],"Wrath":["^You manage to escape the aurora, but it seems to have affected the crew. They begin to get belligerent, attacking each other over every perceived slight against themselves. Before the ensuing pandemonium is brought to a close a few crew members were gravely injured. They will survive, but can no longer perform their duties.","\n","done",{"#f":1}],"Lust":["^You manage to escape the aurora, but it seems to have affected the crew. They become completely enamored with you, explaining that they believe you can do no wrong. The crew proclaim that they would lay down their lives if you asked it of them. Thankfully, this shameful display doesn’t last long, but you find yourself wishing the crew thought like that more often.","\n","done",{"#f":1}],"#f":1}],"listDefs":{}}