{"inkVersion":20,"root":[["^The ship's engines sputter in a desperate attempt to stay active, but eventually give out. The crew has been granted a brief respite while the engines are being repaired. How will you spend this unexpected downtime?","\n","ev","str","^Perform Maintenance","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Check on Crew","/str","/ev",{"*":"0.c-1","flg":4},"ev","str","^Repair Damage","/str","/ev",{"*":"0.c-2","flg":4},"ev","str","^Drill Security","/str","/ev",{"*":"0.c-3","flg":4},{"c-0":[{"->":"Mati"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":[{"->":"Crew"},"\n",{"->":"0.g-0"},{"#f":5}],"c-2":[{"->":"Damage"},"\n",{"->":"0.g-0"},{"#f":5}],"c-3":[{"->":"Drill"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Mati":["^You analyze the weapon systems and find that one of the energy couplers hasn't been supplying the weapons with full power. The crew fixes the fault in no time and you're pleased to find that the ship's weapons have become more powerful. After the engines are repaired, you can't help but wonder how the improved weapons will function.","\n","done",{"#f":1}],"Crew":["^You ask the crew to share stories amongst themselves while they wait for the engines to be repaired. They happily oblige. Some are boring, others enthralling, and you hardly notice the time pass until you receive an alert that the engines are fixed. The ship continues toward its destination with a content crew.","\n","done",{"#f":1}],"Damage":["^You have the crew spend this downtime fixing damage to the ship, both internal and external. While some of the repairs seem slapdash, the ship is in better shape overall. Before long, the engines return to life and the ship sets out to continue the journey.","\n","done",{"#f":1}],"Drill":["^You can't have the security officers getting soft during this downtime, so you improvise a drill schedule for them to run. While the training is unconventional, the officers are happy to have something to do. They seem to be more eager than ever after the engine repairs are complete. You can tell they're itching for some action.","\n","done",{"#f":1}],"#f":1}],"listDefs":{}}