{"inkVersion":20,"root":[["^As you survey the halls of the ship, a curious sight catches your electronic eye. A lone security officer seems to be approaching your main terminal, carrying in his hands some sort of device. You alert Kuon, and he arrives shortly thereafter, catching the officer fiddling with the terminal. Kuon attempts to question the man, but is met instead with a fist. He eventually manages to restrain the rogue officer after a brief scuffle, although it's clear he can't keep it up forever. Kuon looks to you for instruction.","\n","ev","str","^Take Officer to Medbay","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Attempt Interrogation","/str","/ev",{"*":"0.c-1","flg":4},"ev","str","^Remove the Officer","/str","/ev",{"*":"0.c-2","flg":4},{"c-0":[{"->":"Medbay"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":[{"->":"Int"},"\n",{"->":"0.g-0"},{"#f":5}],"c-2":[{"->":"Remove"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Medbay":[["^Kuon drags the officer to Medbay and straps him to a table. Ripley hardly bats an eye. He explains the situation and she immediately performs an examination. She soon explains that the officer in question is braindead. However, his body is being manipulated remotely through his cybernetics. Ripley believes she could sever the connection, but the choice is up to you.","\n","ev","str","^Break Connection","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Get Rid of Him","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":[{"->":"Break"},"\n",{"#f":5}],"c-1":[{"->":"Rid"},"\n",{"#f":5}]}],{"#f":1}],"Break":["^Ripley performs the procedure, severing the control over the man’s body. She sighs, \"Nothing more we can do for him now. He can’t survive without life support.\" The man's vitals stop almost as soon as she finishes speaking. You've lost an officer, but you can tell that taking these steps has helped assuage the discomfort felt by Ripley, Kuon, and the crew.","\n","done",{"#f":1}],"Rid":["^Ripley looks away as Kuon takes the man to his final resting place. The officer is ejected without ceremony, but an uncomfortable air of stress hangs over the crew. Could this happen again?","\n","done",{"#f":1}],"Int":["^Kuon attempts to interrogate the man on who he's working for and what he was trying to do. The man doesn't speak, or is it that he can't? Before Kuon can utter another word the officer's cybernetics begin to blink rapidly. His body begins convulsing as foam starts to pour from his mouth. You and Kuon can only watch in shock as his now lifeless body falls to the floor. The ship has lost a security officer, and you have learned nothing.","\n","done",{"#f":1}],"Remove":["^You instruct Kuon to officer into the airlock. He hesitates until you inform him that insubordination will not be tolerated. You view the officer through the airlock camera as the exterior doors open. You swear he's watching back —through eyes that seem less than alive— as he's cast into the cold reaches of space.","\n","done",{"#f":1}],"#f":1}],"listDefs":{}}