{"inkVersion":20,"root":[["^An unmarked ship pulls up alongside yours and opens a communications channel. Both you and the crew are surprised at what you hear. “Greetings fellow spacefarer! I’m an AI-assisted ship from the Kellis corporation and I seek your assistance. My crew has been less than optimal, would you mind sending some workers over to help rally mine?” The voice seems to stutter and warp as it speaks; what will you do?","\n","ev","str","^Send Over Crew","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Deny Crew","/str","/ev",{"*":"0.c-1","flg":4},"ev","str","^Ask for Proof","/str","/ev",{"*":"0.c-2","flg":4},{"c-0":[{"->":"Send"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":[{"->":"Deny"},"\n",{"->":"0.g-0"},{"#f":5}],"c-2":[{"->":"Proof"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Send":[["^A few crew members venture over to the other ship. Upon entering, they inform you that the interior is riddled with decay and the remains of the previous crew. When they attempt to leave the doors seal them in. The rogue AI speaks, “I’m afraid you cannot leave, you are needed here. Insubordination will not be tolerated.” Your crew are trapped in a mass grave, what will you do?","\n","ev","str","^Destroy the Ship","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Override the Doors","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":[{"->":"Destroy"},"\n",{"#f":5}],"c-1":["\n",["ev","visit",3,"seq","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"ev","du",2,"==","/ev",{"->":".^.s2","c":true},"nop",{"s0":["pop","\n",{"->":"Success"},{"->":".^.^.23"},null],"s1":["pop","\n",{"->":"Success"},{"->":".^.^.23"},null],"s2":["pop","\n",{"->":"Fail"},{"->":".^.^.23"},null],"#f":5}],"\n",{"#f":5}]}],{"#f":1}],"Success":["^You manage to override the outdated security measures and open the doors leading off of the ship. The crew return panicked, but alive. The rogue ship powers its weapons and attempts to attack, but a misfire causes a chain reaction resulting in the ship destroying itself. The crew are thankful, but wish to leave sooner rather than later.","\n","done",{"#f":1}],"Fail":["^Unfortunately, your attempt falls flat. The other AI manages to keep you out of its systems and seeks to retaliate. The rogue ship powers its weapons and attempts to attack, but a misfire causes a chain reaction resulting in the ship destroying itself. Your crew on board are lost, but those still alive are thankful that you attempted to save them.","\n","done",{"#f":1}],"Deny":["^You reluctantly inform the ship that you cannot spare any crew. The voice is silent for a moment, but eventually speaks. “If you will not help, you are opposing Kellis. I will have to take appropriate action.” What follows is a pitiful attempt by the rogue ship to attack yours. Its weapons fail to fire, but yours don’t. The ship is blown to pieces and the voice utters one last line: “Alpha Version 0.4.2 has failed… Kellis...shall..conquer-”. It seems you’ve eradicated one of your predecessors and your crew are pleased by the result.","\n","done",{"#f":1}],"Proof":[["^You ask for proof that the ship is with Kellis. The voice responds, “If you would so kindly direct your attention to the emblem on the side of this ship you will see the Kellis logo, as I am an asset of the corporation.” No such emblem is present, and you notice the general disrepair of the ship. “I return to my original query, will you assist me?”","\n","ev","str","^Send Over Crew","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Deny Crew","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":[{"->":"Send"},"\n",{"#f":5}],"c-1":[{"->":"Deny"},"\n",{"#f":5}]}],{"#f":1}],"Destroy":["^Without a second thought you obliterate the rogue ship. The crew vocalise their displeasure with this outcome, but you are satisfied. That ship will no longer plague this sector, and those that lost their lives aboard it can finally rest in peace among the stars.","\n","done",{"#f":1}],"#f":1}],"listDefs":{}}