{"inkVersion":19,"root":[["^Your head scientist, Lanri, contacts you. \"Hi, hey, small issue, small issue. Looks like the chlorosis and degradation I saw yesterday has gotten worse. Something is killing the plants and‒\" she gasps for emphasis, \"I don't know what!\" We're either going to need to kill all affected buds, manufacture a fungicide, or‒what? Apply a highly nutritious mulch?\" She paces in circles.","\n","ev","str","^Cull Crops(--Food)","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^Mulch Crew(-Crew)","/str","/ev",{"*":"0.c-1","flg":20},"ev","str","^Synthesize Cure(-Credits, Requires Med-bay)","/str","/ev",{"*":"0.c-2","flg":20},{"c-0":["\n",{"->":"Cull"},{"->":"0.g-0"},{"#f":5}],"c-1":["\n",{"->":"Mulch"},{"->":"0.g-0"},{"#f":5}],"c-2":["\n",{"->":"Cure"},{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Cull":["^You tell Lanri to follow the most feasible and direct method. Uproot any crops showing signs of the blight as soon as possible and drop them out the airlock. Lanri nods vigorously, latching onto a plan of action. \"Of course! I’ll start right away.\" Rations are going to be tight for a while, but letting the blight fester would be far worse.","\n","end",{"#f":1}],"Mulch":["^You realize there’s an easy way to create a nutritious mulch between destinations. You tell Lanri it will be tended to. Between her relief and overzealous words of thanks, she doesn't ask about the solution. You request someone to handle diasgnostics in hydroponics, and use the automated arms to quickly and efficiently rip them apart. Lanri soon has her mulch.","\n","end",{"#f":1}],"Cure":["^You tell Lanri to get working at the med-bay as soon as possible to cure the blight. She jumps up and points a finger gun towards the nearest ship camera, \"Leave it to me!\" Using your state-of-the-art facilities, and no small amount of expensive chemicals, she comes up with a hot-fix to prevent the blight from spreading. Employing her work and strategic culling, should keep your food production right where it is.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}