{"inkVersion":19,"root":[["^Your head of R&D calls you, she appears on the monitor, seemingly very excited, \"Sir‒! Ma'am‒ ...Boss.\" she settles on that one, \"There’s a strange anomaly, impossible lights, no discernable source, encoded data within the color variations, the <i>works.</i> Our flight plan is putting us right through it, so I was hoping I could study the crew afterwards, you know, see what happens?\" Protocol insists that exposing your crew to an unidentified aurora is a terrible idea, though the alternative is have the crew fly blind, which could easily lead to collisions.","\n","ev","str","^Blind Pilots (-Hull)","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^Expose Crew to Aurora (???)","/str","/ev",{"*":"0.c-1","flg":20},{"c-0":["\n",{"->":"Blinded"},{"->":"0.g-0"},{"#f":5}],"c-1":["\n",{"->":"randomEnd","var":true},{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Blinded":["^You quickly turn down Lanri's offer to \"just see what happens\" and shutter all viewports across the ship, including the cockpit. Despite the pilots use of radar and other external sensors, the ship impacts something. Within a few seconds the ship scrapes off of another large object. You reduce your speed and continue, until you leave the range of the aurora. Opening the viewports, you see that there were no asteroids in your flight plan, no objects at all. And yet something hit you.","\n","end",{"#f":1}],"Ravenous":["^You accept Lanri's scientific advice to \"just see what happens\" and fly through the aurora normally. Your sensors pixelate, as many of your crew begins to run towards food storage. They begin to rip open packets of rations, wrest food from another's hands, and scarf down what they can. By the time you clear the aurora, everyone is back to normal and your food stores have been heavily depleted.","\n","end",{"#f":3}],"Murderous":["^You accept Lanri's scientific advice to \"just see what happens\" and fly through the aurora normally. Your sensors pixelate, as you start to see the color red quickly dominate the ship. The crew has armed themselves with service tools and are bludgeoning each other to death. You lock down the doors to separate the murderers and wait out the path through the aurora. Once you're clear of the lights, the killers suddenly scramble away from the fresh corpses, not realizing who disposed of them.","\n","end",{"#f":3}],"Surge":["^You accept Lanri's scientific advice to \"just see what happens\" and fly through the aurora normally. Suddenly your crew rushes to their stations and your pilots take you off course. Your attempts to wrest control of the ship do not resolve. The ship swerves into the brightest point of the aurora. Your sensors pixelate, radiation spikes, and you use the malfunction to rip the ship out of the anomaly. Your crew returns to normal, but strangely your power grid is overproducing now, like your reactor is moving just slightly faster than it should. Regardless, it doesn't seem like there was any damage.","\n","end",{"#f":3}],"RandomizeEnding":[{"temp=":"rng"},["ev",{"VAR?":"rng"},0,"==","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"^->":"Ravenous"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.4"},null]}],["ev",{"VAR?":"rng"},1,"==","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"^->":"Murderous"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.4"},null]}],[{"->":".^.b"},{"b":["\n","ev",{"^->":"Surge"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.4"},null]}],"nop","\n",{"#f":1}],"global decl":["ev",{"^->":"Ravenous"},{"VAR=":"randomEnd"},"/ev","end",null],"#f":1}],"listDefs":{}}