{"inkVersion":19,"root":[["^The head doctor, Kelly, calls you, calm despite worried voices in the background, \"It seems that one of the crew member's was misusing a recreational drug. He’s here in the medbay suffering an overdose. He might not survive the night. I am asking for permission to administer some Conaxel to help stabilize him.\" Pausing, she lets out a brief sigh, \"I can understand if you refuse. Our stock of Conaxel is small and refilling it will cost some credits. Plus, while it would bolster his chances to survive, it wouldn't guarantee it.\"","\n","ev","str","^Don't Use Medicine ","/str","/ev",{"*":"0.c-0","flg":20},{"c-0":[{"#":"(60% Chance - 1 Crew)"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":[{"->":"randomEnd","var":true},"ev","str","^Use Medicine ","/str","/ev",{"*":".^.c-1","flg":20},{"c-1":[{"#":"(20% Chance - 1 Crew -20 Credits)"},"\n",{"->":"0.g-1"},{"#f":5}],"#f":5}],"g-1":[{"->":"randomEnd2","var":true},["done",{"#f":5,"#n":"g-2"}],{"#f":5}]}],"done",{"Survive1":["^You tell Kelly to hold off on using the medicine, as it would be a waste to use it and have the crewman die on you anyway. Luckily, he manages to survive the night anyway. Kelly says that he will be able to get back to work in a day or two.","\n","end",{"#f":3}],"Dies1":["^You tell Kelly to hold off on using the medicine, as it would be a waste to use it and have the crewman die on you anyway. Within a few hours, he's dead. Whether the medicine would have helped him survive  will go unknown, but it is better than having a dead crewman as well as lost credits.","\n","end",{"#f":3}],"Survive2":["^You have Kelly administer the Conaxel. The crewman survives the night, and Kelly says he will be able to go back to work after a few days' rest. You make it clear that any more drug abuse will not be tolerated, and that the credits for the Conaxel are coming out of his pay.","\n","end",{"#f":3}],"Dies2":["^You have Kelly administer the Conaxel. Unfortunately, while the medicine stabilizes his condition at first, he worsens overnight, dying early the next day. The credits to refill your stock of Conaxel will have to come from your account.","\n","end",{"#f":3}],"RandomizeEnding":[{"temp=":"rng"},["ev",{"VAR?":"rng"},0,"==","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"^->":"Survive1"},"/ev",{"VAR=":"randomEnd","re":true},"ev",{"^->":"Survive2"},"/ev",{"VAR=":"randomEnd2","re":true},{"->":".^.^.^.4"},null]}],["ev",{"VAR?":"rng"},1,"==","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"^->":"Dies1"},"/ev",{"VAR=":"randomEnd","re":true},"ev",{"^->":"Dies2"},"/ev",{"VAR=":"randomEnd2","re":true},{"->":".^.^.^.4"},null]}],[{"->":".^.b"},{"b":["\n","ev",{"^->":"Dies1"},"/ev",{"VAR=":"randomEnd","re":true},"ev",{"^->":"Dies2"},"/ev",{"VAR=":"randomEnd2","re":true},{"->":".^.^.^.4"},null]}],"nop","\n",{"#f":1}],"global decl":["ev",{"^->":"Survive1"},{"VAR=":"randomEnd"},{"^->":"Survive2"},{"VAR=":"randomEnd2"},"/ev","end",null],"#f":1}],"listDefs":{}}