{"inkVersion":20,"root":[["^The security chief, Kuon, contacts you:  \"We have a situation. A crew member has taken a hostage. She is demanding a sum of credits and some food. She says she has an associate that will pass by our ship and pick her up, at which point she will let the hostage go.\"","\n","^Gritting his teeth, he continues. \"While you could comply with these outrageous demands, my team can take care of the situation. We are in position to act as soon as you give word.\"","\n","ev","str","^Comply","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^Take Her Out","/str","/ev",{"*":"0.c-1","flg":20},{"c-0":["^ ","\n",{"->":"Comply"},{"->":"0.g-0"},{"#f":5}],"c-1":["\n",{"->":"randomEnd","var":true},{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Comply":["^You order that her demands be met. Giving her the food and credits she demanded, you allow her to make her getaway. True to her word, she lets the hostage go, completely unharmed. Although you alert the authorities afterward, you'll never see any of those credits again.","\n","^Kuon seems to be frustrated by this outcome. \"Did you even consider trying to rescue the hostage? Giving into demands like this only emboldens other would-be captors.\" You take his words into consideration as you continue on your journey.","\n","end",{"#f":1}],"Kill1":["^You order your security crew to dispose of her. They manage to take her down with swift and precise shots from their weapons. Her former hostage is alright, albeit shaken up by the close call. You have the body of the would-be criminal thrown out the airlock.","\n","^Kuon seems pleased, \"Good riddance. Disloyalty of this caliber deserves whatever's coming to them.\" You couldn't agree more.","\n","end",{"#f":3}],"Kill2":["^You order your security crew to subdue. While they manage to strike her down with swift and precise shots from their weapons, she executes her hostage in the split second before her own demise. While you store the body of the hostage in the medbay's morgue, you have the murderer's corpse thrown out the airlock.","\n","^Kuon slams his fist into the wall. \"That coward! Such a death is too good for them.\" You continue on your journey.","\n","end",{"#f":3}],"RandomizeEnding":[{"temp=":"rng"},["ev",{"VAR?":"rng"},0,"==","/ev",{"->":".^.b","c":true},{"b":["\n","ev",{"^->":"Kill1"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.3"},null]}],[{"->":".^.b"},{"b":["\n","ev",{"^->":"Kill2"},"/ev",{"VAR=":"randomEnd","re":true},{"->":".^.^.^.3"},null]}],"nop","\n",{"#f":1}],"global decl":["ev",{"^->":"Kill1"},{"VAR=":"randomEnd"},"/ev","end",null],"#f":1}],"listDefs":{}}