{"inkVersion":19,"root":[["^The head of security, Lexa, contacts you,  \"It seems we have a situation. A crew member has taken another hostage. She is demanding fifty credits and some food. She says she has a 'buddy' that will pass by our ship and pick her up, at which point she will let the hostage go.\" Gritting her teeth, she continues, \"While you could comply with these outrageous demands, I recommend you simply let us take care of the situation.\"","\n","ev","str","^Comply (-50 Credits, -2 Food, -1 Crew)","/str","/ev",{"*":"0.c-0","flg":4},"ev","str","^Take Her Out (50% Chance - 1 Crew, 50 Chance -2 Crew)","/str","/ev",{"*":"0.c-1","flg":20},{"c-0":["^ ",{"->":"Comply"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["\n",["ev","visit",2,"seq","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"nop",{"s0":["pop","\n",{"->":"Kill1"},{"->":".^.^.17"},null],"s1":["pop","\n",{"->":"Kill2"},{"->":".^.^.17"},null],"#f":5}],"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Comply":["^You order that her demands be met. Giving her the food and credits she asked for, you allow her to be picked up by another ship. True to her word, she lets the hostage go, completely unharmed. Although you alert the authorities afterward, it is unlikely you will get back any of the credits.","\n","end",{"#f":1}],"Kill1":["^You order your security crew to take her out. They manage to take her down with swift and precise shots from their weapons. Her former hostage, although currently in a state of shock, will be alright. You have the body of the would-be criminal thrown out the airlock.","\n","end",{"#f":1}],"Kill2":["^You order your security crew to take her out. While they manage to take her down with swift and precise shots from their weapons, she was able to put a shot through the head of her hostage in the split second before her own demise. While you store the body of the hostage in the medbay's morgue, you have the murderer's corpse thrown out the airlock.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}